In [11]:
import pandas as pd
path = "D:/Tutedude/Python/13Data Analysis/13.1CONTENT FILES/data.xlsx"
df = pd.read_excel(path)
print(df)

    S.No     A   B   C     D   E
0      1   2.0   1   5   3.0   4
1      2   4.0   3  10   6.0   8
2      3   6.0   5  15   9.0  12
3      4   8.0   7  20  12.0  16
4      5  10.0   9  25  15.0  20
5      6  12.0  11  30  18.0  24
6      7  14.0  13  35  21.0  28
7      8  16.0  15  40  24.0  32
8      9  18.0  17  45  27.0  36
9     10  20.0  19  50  30.0  40
10    11   NaN  21  55   NaN  44

In [13]:
df.head(5)

   S.No     A  B   C     D   E
0     1   2.0  1   5   3.0   4
1     2   4.0  3  10   6.0   8
2     3   6.0  5  15   9.0  12
3     4   8.0  7  20  12.0  16
4     5  10.0  9  25  15.0  20

In [14]:
headers = ["S.No","Even","Odd","Multiples 5","Multiples 3","Multiples 4"]
df.columns = headers
df.head(5)

   S.No  Even  Odd  Multiples 5  Multiples 3  Multiples 4
0     1   2.0    1            5          3.0            4
1     2   4.0    3           10          6.0            8
2     3   6.0    5           15          9.0           12
3     4   8.0    7           20         12.0           16
4     5  10.0    9           25         15.0           20

In [15]:
df["Odd"]=df["Odd"]+1

In [16]:
df.head(5)

   S.No  Even  Odd  Multiples 5  Multiples 3  Multiples 4
0     1   2.0    2            5          3.0            4
1     2   4.0    4           10          6.0            8
2     3   6.0    6           15          9.0           12
3     4   8.0    8           20         12.0           16
4     5  10.0   10           25         15.0           20

In [17]:
df["Odd"]=df["Odd"]-1

In [18]:
df.head(5)

   S.No  Even  Odd  Multiples 5  Multiples 3  Multiples 4
0     1   2.0    1            5          3.0            4
1     2   4.0    3           10          6.0            8
2     3   6.0    5           15          9.0           12
3     4   8.0    7           20         12.0           16
4     5  10.0    9           25         15.0           20

In [23]:
print(df)

    S.No  Even  Odd  Multiples 5  Multiples 3  Multiples 4
0      1   2.0    1            5          3.0            4
1      2   4.0    3           10          6.0            8
2      3   6.0    5           15          9.0           12
3      4   8.0    7           20         12.0           16
4      5  10.0    9           25         15.0           20
5      6  12.0   11           30         18.0           24
6      7  14.0   13           35         21.0           28
7      8  16.0   15           40         24.0           32
8      9  18.0   17           45         27.0           36
9     10  20.0   19           50         30.0           40
10    11   NaN   21           55          NaN           44

In [22]:
# df.drop([10],axis=0)

In [25]:
# df.dropna()

In [27]:
# df.dropna(subset = ["Even"],axis=0)

In [28]:
import numpy as np
df["Even"].replace(np.nan,22)

0      2.0
1      4.0
2      6.0
3      8.0
4     10.0
5     12.0
6     14.0
7     16.0
8     18.0
9     20.0
10    22.0
Name: Even, dtype: float64